MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC11E36FHN33-501/mcu.h

/****************************************************************************************************//**
 * @file     LPC112x.h
 *
 * @brief    CMSIS Cortex-M0 Peripheral Access Layer Header File for
 *           LPC112x from .
 *
 * @version  V0.3
 * @date     19. January 2015
 *
 * @note     Generated with SVDConv V2.84c 
 *           from CMSIS SVD File 'LPC112x.svd' Version 0.3,
 *******************************************************************************************************/



/** @addtogroup (null)
  * @{
  */

/** @addtogroup LPC112x
  * @{
  */

#ifndef LPC112X_H
#define LPC112X_H

#ifdef __cplusplus
extern "C" {
#endif


/* -------------------------  Interrupt Number Definition  ------------------------ */

typedef enum {
/* -------------------  Cortex-M0 Processor Exceptions Numbers  ------------------- */
  Reset_IRQn                    = -15,              /*!<   1  Reset Vector, invoked on Power up and warm reset                 */
  NonMaskableInt_IRQn           = -14,              /*!<   2  Non maskable Interrupt, cannot be stopped or preempted           */
  HardFault_IRQn                = -13,              /*!<   3  Hard Fault, all classes of Fault                                 */
  SVCall_IRQn                   =  -5,              /*!<  11  System Service Call via SVC instruction                          */
  DebugMonitor_IRQn             =  -4,              /*!<  12  Debug Monitor                                                    */
  SysTick_IRQn                  =  -1,              /*!<  15  System Tick Timer                                                */
/* ---------------------  LPC112x Specific Interrupt Numbers  --------------------- */
  PIO0_0_IRQn                   =   0,              /*!<   0  PIO0_0                                                           */
  PIO0_1_IRQn                   =   1,              /*!<   1  PIO0_1                                                           */
  PIO0_2_IRQn                   =   2,              /*!<   2  PIO0_2                                                           */
  PIO0_3_IRQn                   =   3,              /*!<   3  PIO0_3                                                           */
  PIO0_4_IRQn                   =   4,              /*!<   4  PIO0_4                                                           */
  PIO0_5_IRQn                   =   5,              /*!<   5  PIO0_5                                                           */
  PIO0_6_IRQn                   =   6,              /*!<   6  PIO0_6                                                           */
  PIO0_7_IRQn                   =   7,              /*!<   7  PIO0_7                                                           */
  PIO0_8_IRQn                   =   8,              /*!<   8  PIO0_8                                                           */
  PIO0_9_IRQn                   =   9,              /*!<   9  PIO0_9                                                           */
  PIO0_10_IRQn                  =  10,              /*!<  10  PIO0_10                                                          */
  PIO0_11_IRQn                  =  11,              /*!<  11  PIO0_11                                                          */
  PIO1_0_IRQn                   =  12,              /*!<  12  PIO1_0                                                           */
  ADC_B_IRQn                    =  13,              /*!<  13  ADC_B                                                            */
  SSP1_IRQn                     =  14,              /*!<  14  SSP1                                                             */
  I2C_IRQn                      =  15,              /*!<  15  I2C                                                              */
  CT16B0_IRQn                   =  16,              /*!<  16  CT16B0                                                           */
  CT16B1_IRQn                   =  17,              /*!<  17  CT16B1                                                           */
  CT32B0_IRQn                   =  18,              /*!<  18  CT32B0                                                           */
  CT32B1_IRQn                   =  19,              /*!<  19  CT32B1                                                           */
  SSP0_IRQn                     =  20,              /*!<  20  SSP0                                                             */
  UART0_IRQn                    =  21,              /*!<  21  UART0                                                            */
  UART1_IRQn                    =  22,              /*!<  22  UART1                                                            */
  UART2_IRQn                    =  23,              /*!<  23  UART2                                                            */
  ADC_A_IRQn                    =  24,              /*!<  24  ADC_A                                                            */
  WDT_IRQn                      =  25,              /*!<  25  WDT                                                              */
  BOD_IRQn                      =  26,              /*!<  26  BOD                                                              */
  FLASH_IRQn                    =  27,              /*!<  27  FLASH                                                            */
  GPIO3_IRQn                    =  28,              /*!<  28  GPIO3                                                            */
  GPIO2_IRQn                    =  29,              /*!<  29  GPIO2                                                            */
  GPIO1_IRQn                    =  30,              /*!<  30  GPIO1                                                            */
  GPIO0_IRQn                    =  31               /*!<  31  GPIO0                                                            */
} IRQn_Type;


/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/* ----------------Configuration of the Cortex-M0 Processor and Core Peripherals---------------- */
#define __CM0_REV                 0x0000            /*!< Cortex-M0 Core Revision                                               */
#define __MPU_PRESENT                  0            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               2            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0.h"                               /*!< Cortex-M0 processor and core peripherals                              */
// Note: Changed for MikroE implementation.
//#include "system_LPC112x.h"                         /*!< LPC112x System                                                        */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================                       I2C                      ================ */
/* ================================================================================ */


/**
  * @brief I2C-bus interface (I2C)
  */

typedef struct {                                    /*!< (@ 0x40000000) I2C Structure                                          */
  __IO uint32_t  CONSET;                            /*!< (@ 0x40000000) I2C Control Set Register. When a one is written
                                                         to a bit of this register, the corresponding bit in the I2C
                                                          control register is set. Writing a zero has no effect on the
                                                          corresponding bit in the I2C control register.                       */
  __I  uint32_t  STAT;                              /*!< (@ 0x40000004) I2C Status Register. During I2C operation, this
                                                         register provides detailed status codes that allow software
                                                          to determine the next action needed.                                 */
  __IO uint32_t  DAT;                               /*!< (@ 0x40000008) I2C Data Register. During master or slave transmit
                                                         mode, data to be transmitted is written to this register. During
                                                          master or slave receive mode, data that has been received may
                                                          be read from this register.                                          */
  __IO uint32_t  ADR0;                              /*!< (@ 0x4000000C) I2C Slave Address Register 0. Contains the 7-bit
                                                         slave address for operation of the I2C interface in slave mode,
                                                          and is not used in master mode. The least significant bit determines
                                                          whether a slave responds to the General Call address.                */
  __IO uint32_t  SCLH;                              /*!< (@ 0x40000010) SCH Duty Cycle Register High Half Word. Determines
                                                         the high time of the I2C clock.                                       */
  __IO uint32_t  SCLL;                              /*!< (@ 0x40000014) SCL Duty Cycle Register Low Half Word. Determines
                                                         the low time of the I2C clock. I2nSCLL and I2nSCLH together
                                                          determine the clock frequency generated by an I2C master and
                                                          certain times used in slave mode.                                    */
  __O  uint32_t  CONCLR;                            /*!< (@ 0x40000018) I2C Control Clear Register. When a one is written
                                                         to a bit of this register, the corresponding bit in the I2C
                                                          control register is cleared. Writing a zero has no effect on
                                                          the corresponding bit in the I2C control register.                   */
  __IO uint32_t  MMCTRL;                            /*!< (@ 0x4000001C) Monitor mode control register.                         */
  __IO uint32_t  ADR1;                              /*!< (@ 0x40000020) I2C Slave Address Register 1. Contains the 7-bit
                                                         slave address for operation of the I2C interface in slave mode,
                                                          and is not used in master mode. The least significant bit determines
                                                          whether a slave responds to the General Call address.                */
  __IO uint32_t  ADR2;                              /*!< (@ 0x40000024) I2C Slave Address Register 1. Contains the 7-bit
                                                         slave address for operation of the I2C interface in slave mode,
                                                          and is not used in master mode. The least significant bit determines
                                                          whether a slave responds to the General Call address.                */
  __IO uint32_t  ADR3;                              /*!< (@ 0x40000028) I2C Slave Address Register 1. Contains the 7-bit
                                                         slave address for operation of the I2C interface in slave mode,
                                                          and is not used in master mode. The least significant bit determines
                                                          whether a slave responds to the General Call address.                */
  __I  uint32_t  DATA_BUFFER;                       /*!< (@ 0x4000002C) Data buffer register. The contents of the 8 MSBs
                                                         of the I2DAT shift register will be transferred to the DATA_BUFFER
                                                          automatically after every nine bits (8 bits of data plus ACK
                                                          or NACK) has been received on the bus.                               */
  __IO uint32_t  MASK0;                             /*!< (@ 0x40000030) I2C Slave address mask register 0. This mask
                                                         register is associated with I2ADR0 to determine an address match.
                                                          The mask register has no effect when comparing to the General
                                                          Call address (0000000).                                              */
  __IO uint32_t  MASK1;                             /*!< (@ 0x40000034) I2C Slave address mask register 0. This mask
                                                         register is associated with I2ADR0 to determine an address match.
                                                          The mask register has no effect when comparing to the General
                                                          Call address (0000000).                                              */
  __IO uint32_t  MASK2;                             /*!< (@ 0x40000038) I2C Slave address mask register 0. This mask
                                                         register is associated with I2ADR0 to determine an address match.
                                                          The mask register has no effect when comparing to the General
                                                          Call address (0000000).                                              */
  __IO uint32_t  MASK3;                             /*!< (@ 0x4000003C) I2C Slave address mask register 0. This mask
                                                         register is associated with I2ADR0 to determine an address match.
                                                          The mask register has no effect when comparing to the General
                                                          Call address (0000000).                                              */
} LPC_I2C_Type;


/* ================================================================================ */
/* ================                      WWDT                      ================ */
/* ================================================================================ */


/**
  * @brief Windowed WatchDog Timer (WDT) (WWDT)
  */

typedef struct {                                    /*!< (@ 0x40004000) WWDT Structure                                         */
  __IO uint32_t  MOD;                               /*!< (@ 0x40004000) Watchdog mode register. This register contains
                                                         the basic mode and status of the Watchdog Timer.                      */
  __IO uint32_t  TC;                                /*!< (@ 0x40004004) Watchdog timer constant register. This register
                                                         determines the time-out value.                                        */
  __O  uint32_t  FEED;                              /*!< (@ 0x40004008) Watchdog feed sequence register. Writing 0xAA
                                                         followed by 0x55 to this register reloads the Watchdog timer
                                                          with the value contained in TC.                                      */
  __I  uint32_t  TV;                                /*!< (@ 0x4000400C) Watchdog timer value register. This register
                                                         reads out the current value of the Watchdog timer.                    */
  __I  uint32_t  RESERVED;
  __IO uint32_t  WARNINT;                           /*!< (@ 0x40004014) Watchdog Warning Interrupt compare value.              */
  __IO uint32_t  WINDOW;                            /*!< (@ 0x40004018) Watchdog Window compare value.                         */
} LPC_WWDT_Type;


/* ================================================================================ */
/* ================                      UART0                     ================ */
/* ================================================================================ */


/**
  * @brief UART0 (UART0)
  */

typedef struct {                                    /*!< (@ 0x40008000) UART0 Structure                                        */
  
  union {
    __IO uint32_t  DLL;                             /*!< (@ 0x40008000) Divisor Latch LSB. Least significant byte of
                                                         the baud rate divisor value. The full divisor is used to generate
                                                          a baud rate from the fractional rate divider. (DLAB=1)               */
    __O  uint32_t  THR;                             /*!< (@ 0x40008000) Transmit Holding Register. The next character
                                                         to be transmitted is written here. (DLAB=0)                           */
    __I  uint32_t  RBR;                             /*!< (@ 0x40008000) Receiver Buffer Register. Contains the next received
                                                         character to be read. (DLAB=0)                                        */
  };
  
  union {
    __IO uint32_t  IER;                             /*!< (@ 0x40008004) Interrupt Enable Register. Contains individual
                                                         interrupt enable bits for the 7 potential UART interrupts. (DLAB=0)   */
    __IO uint32_t  DLM;                             /*!< (@ 0x40008004) Divisor Latch MSB. Most significant byte of the
                                                         baud rate divisor value. The full divisor is used to generate
                                                          a baud rate from the fractional rate divider. (DLAB=1)               */
  };
  
  union {
    __O  uint32_t  FCR;                             /*!< (@ 0x40008008) FIFO Control Register. Controls UART FIFO usage
                                                         and modes.                                                            */
    __I  uint32_t  IIR;                             /*!< (@ 0x40008008) Interrupt ID Register. Identifies which interrupt(s)
                                                         are pending.                                                          */
  };
  __IO uint32_t  LCR;                               /*!< (@ 0x4000800C) Line Control Register. Contains controls for
                                                         frame formatting and break generation.                                */
  __IO uint32_t  MCR;                               /*!< (@ 0x40008010) Modem Control Register.                                */
  __I  uint32_t  LSR;                               /*!< (@ 0x40008014) Line Status Register. Contains flags for transmit
                                                         and receive status, including line errors.                            */
  __I  uint32_t  MSR;                               /*!< (@ 0x40008018) Modem Status Register.                                 */
  __IO uint32_t  SCR;                               /*!< (@ 0x4000801C) Scratch Pad Register. Eight-bit temporary storage
                                                         for software.                                                         */
  __IO uint32_t  ACR;                               /*!< (@ 0x40008020) Auto-baud Control Register. Contains controls
                                                         for the auto-baud feature.                                            */
  __I  uint32_t  RESERVED;
  __IO uint32_t  FDR;                               /*!< (@ 0x40008028) Fractional Divider Register. Generates a clock
                                                         input for the baud rate divider.                                      */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  TER;                               /*!< (@ 0x40008030) Transmit Enable Register. Turns off UART transmitter
                                                         for use with software flow control.                                   */
  __I  uint32_t  RESERVED2[6];
  __IO uint32_t  RS485CTRL;                         /*!< (@ 0x4000804C) RS-485/EIA-485 Control. Contains controls to
                                                         configure various aspects of RS-485/EIA-485 modes.                    */
  __IO uint32_t  RS485ADRMATCH;                     /*!< (@ 0x40008050) RS-485/EIA-485 address match. Contains the address
                                                         match value for RS-485/EIA-485 mode.                                  */
  __IO uint32_t  RS485DLY;                          /*!< (@ 0x40008054) RS-485/EIA-485 direction control delay.                */
} LPC_UART0_Type;


/* ================================================================================ */
/* ================                     CT16B0                     ================ */
/* ================================================================================ */


/**
  * @brief 16-bit counter/timer CT16B0/1  (CT16B0)
  */

