MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC11E36FHN33-501/mcu.h
typedef struct {                                    /*!< (@ 0x40038000) PMU Structure                                          */
  __IO uint32_t  PCON;                              /*!< (@ 0x40038000) Power control register                                 */
  __IO uint32_t  GPREG[4];                          /*!< (@ 0x40038004) General purpose register 0                             */
  __IO uint32_t  GPREG4;                            /*!< (@ 0x40038014) General purpose register 4                             */
} LPC_PMU_Type;


/* ================================================================================ */
/* ================                    FLASHCTRL                   ================ */
/* ================================================================================ */


/**
  * @brief Flash controller (FLASHCTRL)
  */

typedef struct {                                    /*!< (@ 0x4003C000) FLASHCTRL Structure                                    */
  __I  uint32_t  RESERVED[4];
  __IO uint32_t  FLASHCFG;                          /*!< (@ 0x4003C010) Flash access time configuration register               */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  FMSSTART;                          /*!< (@ 0x4003C020) Signature start address register                       */
  __IO uint32_t  FMSSTOP;                           /*!< (@ 0x4003C024) Signature stop-address register                        */
  __I  uint32_t  RESERVED2;
  __I  uint32_t  FMSW0;                             /*!< (@ 0x4003C02C) Word 0 [31:0]                                          */
  __I  uint32_t  FMSW1;                             /*!< (@ 0x4003C030) Word 1 [63:32]                                         */
  __I  uint32_t  FMSW2;                             /*!< (@ 0x4003C034) Word 2 [95:64]                                         */
  __I  uint32_t  FMSW3;                             /*!< (@ 0x4003C038) Word 3 [127:96]                                        */
  __I  uint32_t  RESERVED3[1001];
  __I  uint32_t  FMSTAT;                            /*!< (@ 0x4003CFE0) Signature generation status register                   */
  __I  uint32_t  RESERVED4;
  __O  uint32_t  FMSTATCLR;                         /*!< (@ 0x4003CFE8) Signature generation status clear register             */
} LPC_FLASHCTRL_Type;


/* ================================================================================ */
/* ================                      SSP0                      ================ */
/* ================================================================================ */


/**
  * @brief SSP0 (SSP0)
  */

typedef struct {                                    /*!< (@ 0x40040000) SSP0 Structure                                         */
  __IO uint32_t  CR0;                               /*!< (@ 0x40040000) Control register 0. Selects the serial clock
                                                         rate, bus type, and data size.                                        */
  __IO uint32_t  CR1;                               /*!< (@ 0x40040004) Control register 1. Selects master/slave and
                                                         other modes.                                                          */
  __IO uint32_t  DR;                                /*!< (@ 0x40040008) Data register. Writes fill the transmit FIFO,
                                                         and reads empty the receive FIFO.                                     */
  __I  uint32_t  SR;                                /*!< (@ 0x4004000C) Status register                                        */
  __IO uint32_t  CPSR;                              /*!< (@ 0x40040010) Clock Prescale register                                */
  __IO uint32_t  IMSC;                              /*!< (@ 0x40040014) Interrupt Mask Set and Clear register                  */
  __I  uint32_t  RIS;                               /*!< (@ 0x40040018) Raw Interrupt Status register                          */
  __I  uint32_t  MIS;                               /*!< (@ 0x4004001C) Masked Interrupt Status register                       */
  __O  uint32_t  ICR;                               /*!< (@ 0x40040020) SSPICR Interrupt Clear register                        */
} LPC_SSP0_Type;


/* ================================================================================ */
/* ================                      IOCON                     ================ */
/* ================================================================================ */


/**
  * @brief I/O configuration (IOCON)  (IOCON)
  */

typedef struct {                                    /*!< (@ 0x40044000) IOCON Structure                                        */
  __IO uint32_t  PIO2_6;                            /*!< (@ 0x40044000) I/O configuration for pin PIO2_6/ CT32B0_MAT1          */
  __I  uint32_t  RESERVED;
  __IO uint32_t  PIO2_0;                            /*!< (@ 0x40044008) I/O configuration for pin PIO2_0/U0_DTR/SSP1_SSEL/
                                                         ADC_PIN_TRIG4                                                         */
  __IO uint32_t  RESET_PIO0_0;                      /*!< (@ 0x4004400C) I/O configuration for pin RESET/PIO0_0                 */
  __IO uint32_t  PIO0_1;                            /*!< (@ 0x40044010) I/O configuration for pin PIO0_1/CLKOUT/CT32B0_MAT2    */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  PIO1_8;                            /*!< (@ 0x40044018) I/O configuration for pin PIO1_8/CT16B1_CAP0/R/U2_TXD  */
  __IO uint32_t  PIO0_2;                            /*!< (@ 0x4004401C) I/O configuration for pin PIO0_2/SSP0_SSEL/CT16B0_CAP0/
                                                         ADC_PIN_TRIG0                                                         */
  __IO uint32_t  PIO2_7;                            /*!< (@ 0x40044020) I/O configuration for pin PIO2_7/ CT32B0_MAT2/U0_RXD   */
  __IO uint32_t  PIO2_8;                            /*!< (@ 0x40044024) I/O configuration for pin PIO2_8/ CT32B0_MAT3/U0_TXD   */
  __IO uint32_t  PIO2_1;                            /*!< (@ 0x40044028) I/O configuration for pin PIO2_1/U0_DSR/SSP1_SCK       */
  __I  uint32_t  RESERVED2;
  __IO uint32_t  PIO0_4;                            /*!< (@ 0x40044030) I/O configuration for pin PIO0_4/I2C0_SCL              */
  __IO uint32_t  PIO0_5;                            /*!< (@ 0x40044034) I/O configuration for pin PIO0_5/I2C0_SDA              */
  __IO uint32_t  PIO1_9;                            /*!< (@ 0x40044038) I/O configuration for pin PIO1_9/CT16B1_MAT0/SSP1_
                                                         MOSI                                                                  */
  __IO uint32_t  PIO3_4;                            /*!< (@ 0x4004403C) I/O configuration for pin PIO3_4/ CT16B0_CAP1/U0_RXD   */
  __IO uint32_t  PIO2_4;                            /*!< (@ 0x40044040) I/O configuration for pin PIO2_4/ CT16B1_MAT1/
                                                         SSP1_SSEL                                                             */
  __IO uint32_t  PIO2_5;                            /*!< (@ 0x40044044) I/O configuration for pin PIO2_5/ CT32B0_MAT0          */
  __IO uint32_t  PIO3_5;                            /*!< (@ 0x40044048) I/O configuration for pin PIO3_5/ CT16B1_CAP1/U0_TXD   */
  __I  uint32_t  RESERVED3[2];
  __IO uint32_t  PIO2_9;                            /*!< (@ 0x40044054) I/O configuration for pin PIO2_9/ CT32B0_CAP0          */
  __IO uint32_t  PIO2_10;                           /*!< (@ 0x40044058) I/O configuration for pin PIO2_10                      */
  __IO uint32_t  PIO2_2;                            /*!< (@ 0x4004405C) I/O configuration for pin PIO2_2/U0_DCD/SSP1_MISO      */
  __IO uint32_t  PIO0_8;                            /*!< (@ 0x40044060) I/O configuration for pin PIO0_8/SSP0_MISO/CT16B0_MAT0/R/AD
                                                         C_PIN_TRIG2                                                           */
  __IO uint32_t  PIO0_9;                            /*!< (@ 0x40044064) I/O configuration for pin PIO0_9SSP0_MOSI/CT16B0_MAT1/R/ADC
                                                         _PIN_TRIG3                                                            */
  __IO uint32_t  SWCLK_PIO0_10;                     /*!< (@ 0x40044068) I/O configuration for pin SWCLK/PIO0_10/ SSP0_SCK/CT16B0_MA
                                                         T2                                                                    */
  __IO uint32_t  PIO1_10;                           /*!< (@ 0x4004406C) I/O configuration for pin PIO1_10/ADC_8/CT16B1_MAT1/
                                                         SSP1_MISO                                                             */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  R_PIO0_11;                         /*!< (@ 0x40044074) I/O configuration for pin R/PIO0_11/ADC_7/CT32B0_MAT3  */
  __IO uint32_t  R_PIO1_0;                          /*!< (@ 0x40044078) I/O configuration for pin R/PIO1_0/ADC_6/CT32B1_CAP0   */
  __IO uint32_t  R_PIO1_1;                          /*!< (@ 0x4004407C) I/O configuration for pin R/PIO1_1/ADC_5/CT32B1_MAT0   */
  __IO uint32_t  R_PIO1_2;                          /*!< (@ 0x40044080) I/O configuration for pin R/PIO1_2/ADC_4/CT32B1_MAT1   */
  __IO uint32_t  PIO3_0;                            /*!< (@ 0x40044084) I/O configuration for pin PIO3_0/U0_DTR/CT16B0_MAT0/
                                                         U0_TXD                                                                */
  __I  uint32_t  RESERVED5;
  __IO uint32_t  PIO2_3;                            /*!< (@ 0x4004408C) I/O configuration for pin PIO2_3/U0_RI/SSP1_MOSI       */
  __IO uint32_t  SWDIO_PIO1_3;                      /*!< (@ 0x40044090) I/O configuration for pin SWDIO/PIO1_3/ADC_3/CT32B1_MAT2 */
  __IO uint32_t  PIO1_4;                            /*!< (@ 0x40044094) I/O configuration for pin PIO1_4/ADC_2/CT32B1_MAT3     */
  __IO uint32_t  PIO1_11;                           /*!< (@ 0x40044098) I/O configuration for pin PIO1_11/ADC_1/CT32B1_CAP1    */
  __IO uint32_t  PIO3_2;                            /*!< (@ 0x4004409C) I/O configuration for pin PIO3_2/U0_DCD/ CT16B0_MAT2/SSP1_S
                                                         CK                                                                    */
  __IO uint32_t  PIO1_5;                            /*!< (@ 0x400440A0) I/O configuration for pin PIO1_5/U0_RTS/CT32B0_CAP0    */
  __IO uint32_t  PIO1_6;                            /*!< (@ 0x400440A4) I/O configuration for pin PIO1_6/U0_RXD/CT32B0_MAT0    */
  __IO uint32_t  PIO1_7;                            /*!< (@ 0x400440A8) I/O configuration for pin PIO1_7/U0_TXD/CT32B0_MAT1    */
  __IO uint32_t  PIO3_3;                            /*!< (@ 0x400440AC) I/O configuration for pin PIO3_3/U0_RI/ CT16B0_CAP0    */
  __IO uint32_t  SCK0_LOC;                          /*!< (@ 0x400440B0) SCK0 pin location select register                      */
  __IO uint32_t  DSR_LOC;                           /*!< (@ 0x400440B4) DSR pin location select register                       */
  __IO uint32_t  DCD_LOC;                           /*!< (@ 0x400440B8) DCD pin location select register                       */
  __IO uint32_t  RI_LOC;                            /*!< (@ 0x400440BC) RI pin location select register                        */
  __IO uint32_t  PIO0_3;                            /*!< (@ 0x400440C0) I/O configuration for pin PIO0_3/R/R/U2_RXD            */
  __IO uint32_t  PIO0_6;                            /*!< (@ 0x400440C4) I/O configuration for pin PIO0_6/SSP0_SCK/U1_TXD       */
  __IO uint32_t  PIO0_7;                            /*!< (@ 0x400440C8) I/O configuration for pin PIO0_7/U0_CTS/ADC_PIN_TRIG1/U1_RX
                                                         D                                                                     */
  __IO uint32_t  SSEL1_LOC;                         /*!< (@ 0x400440CC) SSEL1 pin location select register                     */
  __IO uint32_t  CT16B0_CAP0_LOC;                   /*!< (@ 0x400440D0) CT16B0_CAP0 pin location select register               */
  __IO uint32_t  SCK1_LOC;                          /*!< (@ 0x400440D4) SCK1 pin location select register                      */
  __IO uint32_t  MISO1_LOC;                         /*!< (@ 0x400440D8) MISO1 pin location select register                     */
  __IO uint32_t  MOSI1_LOC;                         /*!< (@ 0x400440DC) MOSI1 pin location select register                     */
  __IO uint32_t  CT32B0_CAP0_LOC;                   /*!< (@ 0x400440E0) CT32B0_CAP0 pin location select register               */
  __IO uint32_t  RXD_LOC;                           /*!< (@ 0x400440E4) RXD pin location select register                       */
} LPC_IOCON_Type;


/* ================================================================================ */
/* ================                     SYSCON                     ================ */
/* ================================================================================ */


/**
  * @brief System configuration (SYSCON) (SYSCON)
  */

typedef struct {                                    /*!< (@ 0x40048000) SYSCON Structure                                       */
  __IO uint32_t  SYSMEMREMAP;                       /*!< (@ 0x40048000) System memory remap                                    */
  __IO uint32_t  PRESETCTRL;                        /*!< (@ 0x40048004) Peripheral reset control                               */
  __IO uint32_t  SYSPLLCTRL;                        /*!< (@ 0x40048008) System PLL control                                     */
  __I  uint32_t  SYSPLLSTAT;                        /*!< (@ 0x4004800C) System PLL status                                      */
  __I  uint32_t  RESERVED[4];
  __IO uint32_t  SYSOSCCTRL;                        /*!< (@ 0x40048020) System oscillator control                              */
  __IO uint32_t  WDTOSCCTRL;                        /*!< (@ 0x40048024) Watchdog oscillator control                            */
  __IO uint32_t  IRCCTRL;                           /*!< (@ 0x40048028) IRC control                                            */
  __I  uint32_t  RESERVED1;
  __IO uint32_t  SYSRSTSTAT;                        /*!< (@ 0x40048030) System reset status register                           */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  SYSPLLCLKSEL;                      /*!< (@ 0x40048040) System PLL clock source select                         */
  __IO uint32_t  SYSPLLCLKUEN;                      /*!< (@ 0x40048044) System PLL clock source update enable                  */
  __I  uint32_t  RESERVED3[10];
  __IO uint32_t  MAINCLKSEL;                        /*!< (@ 0x40048070) Main clock source select                               */
  __IO uint32_t  MAINCLKUEN;                        /*!< (@ 0x40048074) Main clock source update enable                        */
  __IO uint32_t  SYSAHBCLKDIV;                      /*!< (@ 0x40048078) System AHB clock divider                               */
  __I  uint32_t  RESERVED4;
  __IO uint32_t  SYSAHBCLKCTRL;                     /*!< (@ 0x40048080) System AHB clock control                               */
  __I  uint32_t  RESERVED5[4];
  __IO uint32_t  SSP0CLKDIV;                        /*!< (@ 0x40048094) SSP0 clock divider                                     */
  __IO uint32_t  UART0CLKDIV;                       /*!< (@ 0x40048098) UART0 clock divider                                    */
  __IO uint32_t  SSP1CLKDIV;                        /*!< (@ 0x4004809C) SSP1 clock divider                                     */
  __IO uint32_t  UART1CLKDIV;                       /*!< (@ 0x400480A0) UART1 clock divider                                    */
  __IO uint32_t  UART2CLKDIV;                       /*!< (@ 0x400480A4) UART2 clock divider                                    */
  __I  uint32_t  RESERVED6[10];
  __IO uint32_t  WDTCLKSEL;                         /*!< (@ 0x400480D0) WDT clock source select                                */
  __IO uint32_t  WDTCLKUEN;                         /*!< (@ 0x400480D4) WDT clock source update enable                         */
  __IO uint32_t  WDTCLKDIV;                         /*!< (@ 0x400480D8) WDT clock divider                                      */
  __I  uint32_t  RESERVED7;
  __IO uint32_t  CLKOUTCLKSEL;                      /*!< (@ 0x400480E0) CLKOUT clock source select                             */
  __IO uint32_t  CLKOUTUEN;                         /*!< (@ 0x400480E4) CLKOUT clock source update enable                      */
  __IO uint32_t  CLKOUTCLKDIV;                      /*!< (@ 0x400480E8) CLKOUT clock divider                                   */
  __I  uint32_t  RESERVED8[5];
  __I  uint32_t  PIOPORCAP0;                        /*!< (@ 0x40048100) POR captured PIO status 0                              */
  __I  uint32_t  PIOPORCAP1;                        /*!< (@ 0x40048104) POR captured PIO status 1                              */
  __I  uint32_t  RESERVED9[18];
  __IO uint32_t  BODCTRL;                           /*!< (@ 0x40048150) BOD control                                            */
  __IO uint32_t  SYSTCKCAL;                         /*!< (@ 0x40048154) System tick counter calibration                        */
  __I  uint32_t  RESERVED10[6];
  __IO uint32_t  IRQLATENCY;                        /*!< (@ 0x40048170) IQR delay. Allows trade-off between interrupt
                                                         latency and determinism.                                              */
  __IO uint32_t  NMISRC;                            /*!< (@ 0x40048174) NMI source selection                                   */
  __I  uint32_t  RESERVED11[34];
  __IO uint32_t  STARTAPRP0;                        /*!< (@ 0x40048200) Start logic edge control register 0                    */
  __IO uint32_t  STARTERP0;                         /*!< (@ 0x40048204) Start logic signal enable register 0                   */
  __O  uint32_t  STARTRSRP0CLR;                     /*!< (@ 0x40048208) Start logic reset register 0                           */
  __I  uint32_t  STARTSRP0;                         /*!< (@ 0x4004820C) Start logic status register 0                          */
  __I  uint32_t  RESERVED12[8];
  __IO uint32_t  PDSLEEPCFG;                        /*!< (@ 0x40048230) Power-down states in Deep-sleep mode                   */
  __IO uint32_t  PDAWAKECFG;                        /*!< (@ 0x40048234) Power-down states after wake-up from Deep-sleep
                                                         mode                                                                  */
  __IO uint32_t  PDRUNCFG;                          /*!< (@ 0x40048238) Power-down configuration register                      */
} LPC_SYSCON_Type;


/* ================================================================================ */
/* ================                      GPIO0                     ================ */
/* ================================================================================ */


/**
  * @brief GPIO0 (GPIO0)
  */

typedef struct {                                    /*!< (@ 0x50000000) GPIO0 Structure                                        */
  __I  uint32_t  RESERVED[4095];
  __IO uint32_t  DATA;                              /*!< (@ 0x50003FFC) Port n data register for pins PIOn_0 to PIOn_11        */
  __I  uint32_t  RESERVED1[4096];
  __IO uint32_t  DIR;                               /*!< (@ 0x50008000) Data direction register for port n                     */
  __IO uint32_t  IS;                                /*!< (@ 0x50008004) Interrupt sense register for port n                    */
  __IO uint32_t  IBE;                               /*!< (@ 0x50008008) Interrupt both edges register for port n               */
  __IO uint32_t  IEV;                               /*!< (@ 0x5000800C) Interrupt event register for port n                    */
  __IO uint32_t  IE;                                /*!< (@ 0x50008010) Interrupt mask register for port n                     */
  __I  uint32_t  RIS;                               /*!< (@ 0x50008014) Raw interrupt status register for port n               */
  __I  uint32_t  MIS;                               /*!< (@ 0x50008018) Masked interrupt status register for port n            */
  __O  uint32_t  IC;                                /*!< (@ 0x5000801C) Interrupt clear register for port n                    */
} LPC_GPIO0_Type;


/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif




/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define LPC_I2C_BASE                    0x40000000UL
#define LPC_WWDT_BASE                   0x40004000UL
#define LPC_UART0_BASE                  0x40008000UL
#define LPC_CT16B0_BASE                 0x4000C000UL
#define LPC_CT16B1_BASE                 0x40010000UL
#define LPC_CT32B0_BASE                 0x40014000UL
#define LPC_CT32B1_BASE                 0x40018000UL
#define LPC_ADC_BASE                    0x4001C000UL
#define LPC_UART1_BASE                  0x40020000UL
#define LPC_UART2_BASE                  0x40024000UL
#define LPC_PMU_BASE                    0x40038000UL
#define LPC_FLASHCTRL_BASE              0x4003C000UL
#define LPC_SSP0_BASE                   0x40040000UL
#define LPC_IOCON_BASE                  0x40044000UL
#define LPC_SYSCON_BASE                 0x40048000UL
#define LPC_SSP1_BASE                   0x40058000UL
#define LPC_GPIO0_BASE                  0x50000000UL
#define LPC_GPIO1_BASE                  0x50010000UL
#define LPC_GPIO2_BASE                  0x50020000UL
#define LPC_GPIO3_BASE                  0x50030000UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

