MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/LPC11E36FHN33-501/mcu.h
#define LPC_I2C                         ((LPC_I2C_Type            *) LPC_I2C_BASE)
#define LPC_WWDT                        ((LPC_WWDT_Type           *) LPC_WWDT_BASE)
#define LPC_UART0                       ((LPC_UART0_Type          *) LPC_UART0_BASE)
#define LPC_CT16B0                      ((LPC_CT16B0_Type         *) LPC_CT16B0_BASE)
#define LPC_CT16B1                      ((LPC_CT16B0_Type         *) LPC_CT16B1_BASE)
#define LPC_CT32B0                      ((LPC_CT32B0_Type         *) LPC_CT32B0_BASE)
#define LPC_CT32B1                      ((LPC_CT32B0_Type         *) LPC_CT32B1_BASE)
#define LPC_ADC                         ((LPC_ADC_Type            *) LPC_ADC_BASE)
#define LPC_UART1                       ((LPC_UART0_Type          *) LPC_UART1_BASE)
#define LPC_UART2                       ((LPC_UART0_Type          *) LPC_UART2_BASE)
#define LPC_PMU                         ((LPC_PMU_Type            *) LPC_PMU_BASE)
#define LPC_FLASHCTRL                   ((LPC_FLASHCTRL_Type      *) LPC_FLASHCTRL_BASE)
#define LPC_SSP0                        ((LPC_SSP0_Type           *) LPC_SSP0_BASE)
#define LPC_IOCON                       ((LPC_IOCON_Type          *) LPC_IOCON_BASE)
#define LPC_SYSCON                      ((LPC_SYSCON_Type         *) LPC_SYSCON_BASE)
#define LPC_SSP1                        ((LPC_SSP0_Type           *) LPC_SSP1_BASE)
#define LPC_GPIO0                       ((LPC_GPIO0_Type          *) LPC_GPIO0_BASE)
#define LPC_GPIO1                       ((LPC_GPIO0_Type          *) LPC_GPIO1_BASE)
#define LPC_GPIO2                       ((LPC_GPIO0_Type          *) LPC_GPIO2_BASE)
#define LPC_GPIO3                       ((LPC_GPIO0_Type          *) LPC_GPIO3_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group LPC112x */
/** @} */ /* End of group (null) */

#ifdef __cplusplus
}
#endif


#endif  /* LPC112x_H */

